# GenericRefractionTranslucencyWeight Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Generic..::..GenericRefractionTranslucencyWeight Property
Generic Class See Also
---
The property labeled "Translucency" from the "Generic" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string GenericRefractionTranslucencyWeight { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GenericRefractionTranslucencyWeight As String
	Get
```

Visual C++
---
```text
public:
static property String^ GenericRefractionTranslucencyWeight {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 1". This property allows a connected asset.
# See Also
Generic Class
Autodesk.Revit.DB.Visual Namespace